import React from 'react';
import Hero from './components/Hero.tsx';
import './App.css';
import Header from './components/Header.tsx';
import ImageTextSplit from './components/ImageTextSplit.tsx';
import img_1 from "./assets/ngc/img_1.png";
import img_2 from "./assets/ngc/img_2.png";
import img_3 from "./assets/ngc/img_3.png";
import Footer from './components/Footer.tsx';
import VideoSection from './components/VideoSection.tsx';
import SliderSection from './components/SliderSection.tsx';
import GoalsSection from './components/GoalsSection.tsx';

function App() {

  return (
    <div className='min-h-screen bg-ngc_light_orange'>
      <Header />
      <Hero />

      <div className='my-20 lg:my-36 flex flex-col gap-12 lg:gap-28'>
        <ImageTextSplit
          id="who-we-are"
          imgUrl={img_1}
          subText='مبادرة استراتيجية لتعزيز الأمن الغذائي'
          title='عن شركة الحبوب الوطنية'
          text='شركة الحبوب الوطنية، التي تأسست في أغسطس 2020م، هي ثمرة شراكة استراتيجية بين الشركة السعودية للاستثمار الزراعي والإنتاج الحيواني "سالك" والشركة الوطنية السعودية للنقل البحري "البحري". تهدف الشركة إلى تعزيز الأمن الغذائي في المملكة، وقد شهدت مؤخرًا توقيع عقد لإنشاء محطة ينبع لمناولة الحبوب بطاقة استيعابية تقدر بـ 156,000 طن في المرحلة الأولى. يتمتع المشروع بدعم ومتابعة من وزارة البيئة والمياه والزراعة، ويأتي ضمن الجهود المستمرة لتعزيز سرعة وصول الحبوب الرئيسية للمملكة وربطها بمصادر الحبوب العالمية.'
          reverse
        />
        <ImageTextSplit
          imgUrl={img_2}
          subText='إطلاق شركة الحبوب الوطنية'
          title='مراسم التأسيس'
          text='جــرت مراســم التأســيس بين "سالك" و"البحري" وأُعلن اسم "شركة الحبوب الوطنية" في مقر وزارة البيئة والمياه والزراعة برعايــة معالــي المهنــدس عبدالرحمــن بــن عبدالمحســن الفضلــي وزيــر البيئـة والميـاه والزراعـة رئيـس مجلـس إدارة شـركة «سـالك»، وبحضـور كل مـن المهنـدس أحمـد بـن عبدالعزيـز الفـارس محافـظ المؤسسـة العامـة للحبـوب والأسـتاذ محمـد بـن عبدالعزيـز السـرحان رئيـس مجلـس إدارة شــركة «البحــري»، وســعادة المهنــدس ســليمان بــن عبدالرحمــن الرميــح الرئيـس التنفيـذي لشـركة «سـالك»، والمهنـدس عبـداالله بن علـي الدبيخي الرئيــس التنفيــذي لشــركة البحــري.'
        />
        <ImageTextSplit
          id="strategic-dimension"
          imgUrl={img_3}
          subText='رؤية مستقبلية لتأمين احتياجات المملكة'
          title='البعــد الاستراتيجـــي'
          text='تأتــي هــذه الشــراكة بهــدف تلبيــة الاحتياجــات المســتقبلية للمملكــة مــن الحبـوب الرئيسـية في ظـل التوجـه نحـو الحفـاظ علـى الأمـن المائـي والحـد مـن زراعـة الأعـلاف التـي تسـتهلك كميـات كبيـرة مـن الميـاه، بالإضافـة إلــى تماشــي المشــروع مــع تحقيــق مســتهدفات رؤيــة المملكــة 2030 المتمثلـة في جعلهـا بوابـة عالميـة متفـردة للخدمـات اللوجسـتية تربـط بـين القـارات الثـلاث إذ يعـد مينـاء ينبـع التجـاري أحـد المواقـع الاسـتراتيجية المطلــة علــى مصــادر الحبــوب العالميــة لــذا كانــت الاتفاقيــة بــين ســالك وموانـئ لإقامـة المشـروع.'
          reverse
        />
      </div>

      <VideoSection />

      <SliderSection />

      <GoalsSection />

      <Footer />
    </div>
  )
}

export default App
